window.AppData = window.AppData || {};

window.AppData.library = {
    "1": {
        "title": "Дикий робот",
        "rating": 8.4,
        "poster": "assets/images/Дикий робот (2024).jpg",
        "age": "6+",
        "description": "Посылка с роботом-помощником ROZZUM 7134 падает на необитаемый остров. Тщетно пытаясь найти задания, которые можно выполнить, робот выучивает язык животных и по наставлению опытной мамы-опоссума начинает заботиться о крохотном гусёнке, чью семью он случайно раздавил. В консультанты к нему набивается «специалист по гусям» хитрый лис Финк, с которым никто не хочет дружить.",
        "media": [
            { "type": "video", "src": "dnYMdlt1vCU" },
            { "type": "video", "src": "u7SfIW5tjdE" },
            { "type": "image", "src": "https://i.ytimg.com/vi/dnYMdlt1vCU/maxresdefault.jpg" }
        ],
        "year": "2024",
        "country": "США, Япония",
        "duration": "1 ч 42 мин",
        "director": "Крис Сандерс",
        "mpaa": "PG"
    },
    "2": {
        "title": "Иллюзия обмана 3",
        "franchise": "now_you_see_me",
        "part": 3,
        "partName": "Иллюзия обмана 3 (2025)",
        "rating": 6.9,
        "poster": "assets/images/Иллюзия обмана 3 (2025).jpg",
        "age": "16+",
        "description": "«Четыре всадника» возвращаются вместе с молодым поколением иллюзионистов, демонстрируя головокружительные трюки, магию и превращения, каких еще не видел мир.",
        "media": [
            { "type": "video", "src": "z3Kl3jubJ9I" },
            { "type": "video", "src": "Goc9D8bVYPc" },
            { "type": "video", "src": "wySOLxvatTQ" },
            { "type": "image", "src": "https://i.ytimg.com/vi/z3Kl3jubJ9I/maxresdefault.jpg" }
        ],
        "year": "2025",
        "country": "США",
        "duration": "1 ч 52 мин",
        "director": "Рубен Фляйшер",
        "mpaa": "PG-13"
    },
    "3": {
        "title": "Пять ночей с Фредди",
        "rating": 5.8,
        "poster": "assets/images/Пять ночей с Фредди (2023).jpg",
        "age": "18+",
        "description": "Пытаясь сохранить опекунство над сестрёнкой, Майк Шмидт устраивается работать ночным охранником в «Freddy Fazbear’s» — некогда популярный, но ныне закрытый семейный развлекательный центр. Несколько лет назад, когда Майк был ещё ребёнком, его младшего брата похитил неизвестный, и к этому событию парень снова и снова возвращается во сне, пытаясь вспомнить лицо похитителя. На новой работе в его снах появляются новые подробности — кажется, это место хранит зловещие тайны.",
        "media": [
            { "type": "video", "src": "WgKp00O9wCQ" },
            { "type": "video", "src": "ZLc75xxc0FM" },
            { "type": "image", "src": "https://i.ytimg.com/vi/WgKp00O9wCQ/maxresdefault.jpg" }
        ],
        "year": "2023",
        "country": "США",
        "duration": "1 ч 49 мин",
        "director": "Эмма Тамми",
        "mpaa": "PG-13"
    },
    "4": {
        "title": "Kingsman: Секретная служба",
        "rating": 7.7,
        "poster": "assets/images/Kingsman Секретная служба (2015).jpg",
        "age": "18+",
        "description": "Эггси прошел службу в морской пехоте и имеет высокий интеллект. Он мог бы добиться многого, но выбрал другой путь и стал мелким преступником. Однажды он знакомится с Гарри Хартом, которому его отец когда-то спас жизнь. Этот человек решает сделать жизнь Эггси лучше и открыть для него новые возможности. Гарри рассказывает, что является агентом секретной независимой организации, которая стоит на защите мира, и предлагает парню пройти обучение и стать новым членом их команды.",
        "media": [
            { "type": "video", "src": "Ee9kXN3e8iQ" },
            { "type": "video", "src": "zGmke5L8VkI" },
            { "type": "image", "src": "https://i.ytimg.com/vi/Ee9kXN3e8iQ/maxresdefault.jpg" }
        ],
        "year": "2015",
        "country": "Великобритания, США",
        "duration": "2 ч 10 мин",
        "director": "Мэттью Вон",
        "mpaa": "R"
    },
    "5": {
        "title": "ВАЛЛ-И",
        "rating": 8.4,
        "poster": "assets/images/ВАЛЛ-И (2008).jpg",
        "age": "0+",
        "description": "Робот ВАЛЛ·И из года в год прилежно трудится на опустевшей Земле, очищая нашу планету от гор мусора, которые оставили после себя улетевшие в космос люди. Он и не представляет, что совсем скоро произойдут невероятные события, благодаря которым он встретит друзей, поднимется к звездам и даже сумеет изменить к лучшему своих бывших хозяев, совсем позабывших родную Землю.",
        "media": [
            { "type": "video", "src": "pATSLKKeKVY" },
            { "type": "image", "src": "https://i.ytimg.com/vi/pATSLKKeKVY/maxresdefault.jpg" }
        ],
        "year": "2008",
        "country": "США",
        "duration": "1 ч 38 мин",
        "director": "Эндрю Стэнтон",
        "mpaa": "G"
    },
    "6": {
        "title": "Кошмар перед Рождеством",
        "rating": 8.1,
        "poster": "assets/images/Кошмар перед Рождеством (1993).jpg",
        "age": "12+",
        "description": "В царстве Хэллоуин, царстве страхов и кошмаров, живут мертвецы, уродцы, чудовища во главе с царем ужасов Джеком Скеллингтоном. Под рождество Джек случайно попадает в город Рождества, где узнает, что где-то есть радость, добро и веселье. Ему страшно захотелось испытать это чувство — дарить людям счастье — и он похитил Санта Клауса и занял его место.",
        "media": [
            { "type": "video", "src": "0styVB5CdLY" },
            { "type": "video", "src": "wr6N_hZyBCk" },
            { "type": "image", "src": "https://i.ytimg.com/vi/0styVB5CdLY/maxresdefault.jpg" }
        ],
        "year": "1993",
        "country": "США",
        "duration": "1 ч 16 мин",
        "director": "Генри Селик",
        "mpaa": "PG"
    },
    "7": {
        "title": "Человек-бензопила: История Резе",
        "franchise": "chainsaw_man",
        "part": 2,
        "partName": "Фильм: Резе",
        "rating": 8.3,
        "poster": "assets/images/Человек-бензопила. Фильм История Резе (2025).png",
        "age": "18+",
        "description": "Молодой охотник на демонов Дэндзи, который ждал свидания со своей возлюбленной Макимой, попадает под ливень. Укрывшись от дождя, он случайно встречает девушку по имени Резе, работающую в соседнем кафе. Та добродушно ему улыбается, и разговор становится более непринужденным. После этой встречи повседневная жизнь Дэндзи начинает меняться.",
        "media": [
            { "type": "video", "src": "d1n552v1ng0" },
            { "type": "video", "src": "kXFBM9sT3G0" },
            { "type": "image", "src": "https://i.ytimg.com/vi/d1n552v1ng0/maxresdefault.jpg" }
        ],
        "year": "2025",
        "country": "Япония",
        "duration": "1 ч 40 мин",
        "director": "Тацуя Ёсихара",
        "mpaa": "R"
    },
    "8": {
        "title": "Есть только МиГ",
        "rating": 6.7,
        "poster": "assets/images/Есть только МиГ (2025).jpg",
        "age": "12+",
        "description": "1944 год. После госпиталя или из-за проблем со зрением и речью нескольких офицеров «списывают» на ложный аэродром. Этот аэродром гитлеровцы принимают за настоящий, и летчик Иван Поливанов узнает об этом в самый неподходящий момент.",
        "media": [
            { "type": "video", "src": "bOqiyrx2PJA" },
            { "type": "video", "src": "PD9H5wMbdPs" },
            { "type": "image", "src": "https://i.ytimg.com/vi/bOqiyrx2PJA/maxresdefault.jpg" }
        ],
        "year": "2025",
        "country": "Россия",
        "duration": "1 ч 40 мин",
        "director": "Александр Жигалкин",
        "mpaa": "12+"
    },
    "9": {
        "title": "1+1",
        "rating": 8.9,
        "poster": "assets/images/1+1 (2011).jpg",
        "age": "18+",
        "description": "Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой работы, – молодого жителя предместья Дрисса, только что освободившегося из тюрьмы. Несмотря на то, что Филипп прикован к инвалидному креслу, Дриссу удается привнести в размеренную жизнь аристократа дух приключений.",
        "media": [
            { "type": "video", "src": "tTwFeGArcrs" },
            { "type": "image", "src": "https://i.ytimg.com/vi/tTwFeGArcrs/maxresdefault.jpg" }
        ],
        "year": "2011",
        "country": "Франция",
        "duration": "1 ч 52 мин",
        "director": "Оливье Накаш, Эрик Толедано",
        "mpaa": "R"
    },
    "10": {
        "title": "Человек-бензопила",
        "franchise": "chainsaw_man",
        "part": 1,
        "partName": "Сезон 1 (Сериал)",
        "rating": 8.5,
        "poster": "assets/images/Человек-бензопила (сериал 2022).jpeg",
        "age": "18+",
        "description": "Подросток Дэндзи всего лишь хотел жить обычной жизнью и есть досыта, но оставшиеся после смерти отца долги вынуждают парня влачить полуголодное существование и жить в халупе. Чтобы расплатиться с якудза, он уже продал некоторые свои органы и даже промышляет нелегальной охотой на демонов, в чём ему помогает необычный питомец Потита, демоническое существо с бензопилой. Однажды коварные бандиты заманивают Дэндзи в ловушку и приносят в жертву, но Потита не даёт парню умереть. Он сращивает его тело и становится сердцем своего хозяина — теперь Дэндзи обладает повышенной регенерацией, а также может превращать конечности в бензопилы. Такого ценного кадра нанимает Бюро общественной безопасности, чтобы тот снова охотился на демонов. На новой работе парень знакомится с коллегами — меланхоличным охотником Аки, вспыльчивой полудемонессой Пауэр — и влюбляется в свою загадочную начальницу Макиму.",
        "media": [
            { "type": "video", "src": "j9sSzNmB5po" },
            { "type": "video", "src": "l96zmDlWCBk" },
            { "type": "video", "src": "OatDU-PgJQE" },
            { "type": "image", "src": "https://i.ytimg.com/vi/j9sSzNmB5po/maxresdefault.jpg" }
        ],
        "year": "2022",
        "country": "Япония",
        "duration": "24 мин",
        "director": "Рю Накаяма",
        "mpaa": "R"
    },
    "11": {
        "title": "Человек-паук: Через вселенные",
        "franchise": "spider_verse",
        "part": 1,
        "partName": "Через вселенные (2018)",
        "rating": 8.2,
        "poster": "assets/images/Человек-паук Через вселенные (2018).jpg",
        "age": "6+",
        "description": "Мы всё знаем о Питере Паркере. Он спас город, влюбился, а потом спасал город снова и снова… Но все это – в нашем измерении. А что если в результате работы гигантского коллайдера откроется окно из одного измерения в другое? Найдется ли в нем свой Человек-паук? И как он будет выглядеть? Приготовьтесь к тому, что в разных вселенных могут быть разные Люди-пауки и однажды им придется собраться вместе для борьбы с почти непобедимым врагом.",
        "media": [
            { "type": "video", "src": "uaNqhT7ueTQ" },
            { "type": "image", "src": "https://i.ytimg.com/vi/uaNqhT7ueTQ/maxresdefault.jpg" }
        ],
        "year": "2018",
        "country": "Канада, США",
        "duration": "1 ч 57 мин",
        "director": "Боб Персичетти, Питер Рэмзи, Родни Ротман",
        "mpaa": "PG"
    },
    "12": {
        "title": "Человек-паук: Паутина вселенных",
        "franchise": "spider_verse",
        "part": 2,
        "partName": "Паутина вселенных (2023)",
        "rating": 8.3,
        "poster": "assets/images/Человек-паук Паутина вселенных (2023).jpg",
        "age": "12+",
        "description": "После воссоединения с Гвен Стейси дружелюбный сосед Человек-Паук попадает из Бруклина в Мультивселенную, где встречает команду Паучков, защищающих само её существование. Пытаясь справиться с новой угрозой, Майлз сталкивается с Пауками из других вселенных. Настаёт момент, когда ему необходимо решить, что значит быть героем, спасающим тех, кого любишь больше всего.",
        "media": [
            { "type": "video", "src": "lD-6yaNWqKA" },
            { "type": "image", "src": "https://i.ytimg.com/vi/lD-6yaNWqKA/maxresdefault.jpg" }
        ],
        "year": "2023",
        "country": "США",
        "duration": "2 ч 20 мин",
        "director": "Жуакин Душ Сантуш, Кемп Пауэрс, Джастин Томпсон",
        "mpaa": "PG"
    },
    "13": {
        "title": "Аркейн",
        "rating": 8.8,
        "poster": "assets/images/Аркейн (сериал 2021 – 2024).jpg",
        "age": "16+",
        "description": "История разворачивается в утопическом краю Пилтовер и жестоком подземном мире Заун и рассказывает о становлении двух легендарных чемпионов Лиги и о той силе, что разведёт их по разные стороны баррикад.",
        "media": [
            { "type": "video", "src": "PilxSMg5Y4E" },
            { "type": "video", "src": "tELnewx29S8" },
            { "type": "video", "src": "OltEoCie0Fg" },
            { "type": "image", "src": "https://i.ytimg.com/vi/PilxSMg5Y4E/maxresdefault.jpg" }
        ],
        "year": "2021 – 2024",
        "country": "США, Франция",
        "duration": "42 мин",
        "director": "Паскаль Шаррю, Арно Делорд",
        "mpaa": "TV-14"
    },
    "14": {
        "title": "Барби",
        "rating": 6.6,
        "poster": "assets/images/Барби (2023).jpg",
        "age": "18+",
        "description": "Самая обыкновенная стереотипная Барби живёт в великолепном розовом Барбиленде, и каждый её день идеален. Она меняет наряды, загорает на пляже, проводит время с другими Барби, день заканчивается шумной вечеринкой с танцами, и в этой позитивной кутерьме с блёстками влюблённый Кен — всего лишь приложение к Барби. Однажды куклу посещают мысли о смерти, и её сделанные под туфли с каблуками ноги вдруг становятся плоскими. Чтобы разобраться в происходящем и вернуть привычный пластмассовый мир, Барби придётся отправиться в мир реальный и найти там свою девочку-хозяйку. За ней увязывается не мыслящий жизни без своего кумира Кен.",
        "media": [
            { "type": "video", "src": "8zIf0X4L9a8" }
        ],
        "year": "2023",
        "country": "США, Великобритания",
        "duration": "1 ч 54 мин",
        "director": "Грета Гервиг",
        "mpaa": "PG-13"
    },
    "15": {
        "title": "Закулисье реальности",
        "rating": 6.5,
        "poster": "assets/images/Закулисье реальности (2026).jpg",
        "age": "18+",
        "description": "Кларк, одинокий владелец мебельного магазина, никак не может оправиться после развода и посещает психолога. Он ночует на работе и однажды обнаруживает проход в другое измерение. Так Кларк оказывается в бесконечном лабиринте жёлтых комнат и коридоров, где пространство живёт по своей логике, а нечто жуткое может скрываться за каждым углом.",
        "media": [
            { "type": "video", "src": "H4g26t_sL90" }
        ],
        "year": "2026",
        "country": "США, Канада",
        "duration": "1 ч 50 мин",
        "director": "Кейн Парсонс",
        "mpaa": "R"
    },
    "16": {
        "title": "Последний богатырь",
        "rating": 7.2,
        "poster": "assets/images/Последний богатырь (2017).jpg",
        "age": "12+",
        "description": "Победитель 5-го сезона «Битвы магов» белый маг Святозар, а на самом деле — обычный парень Иван, привычно пудрит мозги телезрителям и доверчивым клиентам, готовым поверить во что угодно. Однажды, спасаясь бегством от крепких охранников мужа очередной одураченной им домохозяйки, парень внезапно переносится из Москвы в сказочную страну Белогорье. А встреченный там старец объявляет Ивану, что тот — сын Ильи Муромца, и только он может их спасти. Так наш «белый маг» оказывается в эпицентре противостояния волшебных сил добра и зла, вот только сам парень уверен, что он тут совершенно ни при чём, и всё это — какая-то нелепая ошибка.",
        "media": [
            { "type": "video", "src": "V5R9HwT0r_g" }
        ],
        "year": "2017",
        "country": "Россия",
        "duration": "1 ч 54 мин",
        "director": "Дмитрий Дьяченко",
        "mpaa": "PG"
    },
    "17": {
        "title": "Братья Супер Марио в кино",
        "rating": 7.0,
        "poster": "assets/images/Братья Супер Марио в кино (2023).jpg",
        "age": "6+",
        "description": "Братья-водопроводчики Марио и Луиджи открывают портал в подземный город, из которого должны вызволить пленённую принцессу Пич и сразиться с заклятым врагом Боузером.",
        "media": [
            { "type": "video", "src": "TnGl01FkMMo" }
        ],
        "year": "2023",
        "country": "США, Япония",
        "duration": "1 ч 32 мин",
        "director": "Аарон Хорват, Михаэль Еленик, Пьер Ледюк",
        "mpaa": "PG"
    },
    "18": {
        "title": "Кот в сапогах 2: Последнее желание",
        "rating": 8.1,
        "poster": "assets/images/Кот в сапогах 2 Последнее желание (2022).jpg",
        "age": "6+",
        "description": "Промотав восемь жизней из девяти и до смерти испугавшись пришедшего за ним волка-охотника за головами, Кот в сапогах внимает совету врача и заселяется в дом местной кошатницы. Там он смиряется с установленными порядками, отращивает бороду и теряет тягу к подвигам и приключениям, но только до тех пор, пока не узнаёт о волшебной карте, которая указывает путь к где-то упавшей Звезде желаний. Кот в сапогах твёрдо решает отыскать Звезду, чтобы вернуть свои жизни, и в компании притворявшегося кошачьим пёсика отправляется красть карту у известного коллекционера волшебных предметов Джека Хорнера.",
        "media": [
            { "type": "video", "src": "tHb7WlgyaUc" }
        ],
        "year": "2022",
        "country": "США, Япония",
        "duration": "1 ч 42 мин",
        "director": "Джоэль Кроуфорд, Хануэль Меркадо",
        "mpaa": "PG"
    },
    "19": {
        "title": "Груз 200",
        "rating": 6.8,
        "poster": "assets/images/Груз 200 (2007).jpg",
        "age": "18+",
        "description": "СССР, 1984 год. Провинция. После дискотеки пропадает дочь секретаря райкома партии. Свидетелей нет, виновные не обнаружены. В этот же вечер в доме на окраине города происходит жестокое убийство. Обвиняемый — хозяин дома. Расследования обоих преступлений поручены капитану милиции Журову.",
        "media": [
            { "type": "video", "src": "24X_2sJ_43Y" }
        ],
        "year": "2007",
        "country": "Россия",
        "duration": "1 ч 30 мин",
        "director": "Алексей Балабанов",
        "mpaa": "R"
    },
    "20": {
        "title": "Мстители: Доктор Дум",
        "rating": null,
        "poster": "assets/images/Мстители Доктор Дум (2026).jpg",
        "age": "16+",
        "description": "Мстители, Люди Икс, Фантастическая четвёрка, вакандцы и Новые Мстители объединяются, чтобы противостоять Доктору Думу.",
        "media": [
            { "type": "video", "src": "v_W3_gB78tY" }
        ],
        "year": "2026",
        "country": "США",
        "duration": "2 ч 45 мин",
        "director": "Энтони Руссо, Джо Руссо",
        "mpaa": "PG-13"
    },
    "21": {
        "title": "Кей-поп-охотницы на демонов",
        "rating": 7.6,
        "poster": "assets/images/Кей-поп-охотницы на демонов (2025).jpg",
        "age": "12+",
        "description": "С древних времён девушки с необычными голосами охраняют людей от демонов: пением устанавливают защитный барьер, чтобы зло не проникло в наш мир. Такова миссия трёх участниц женской кей-поп-группы Huntrix, и они с ней успешно справлялись, пока их фанатов не начала переманивать мужская — команда коварных демонов, прикидывающихся симпатичными парнями.",
        "media": [
            { "type": "video", "src": "e9Z341M4k_0" }
        ],
        "year": "2025",
        "country": "США",
        "duration": "1 ч 35 мин",
        "director": "Крис Аппельханс, Мэгги Кан",
        "mpaa": "PG"
    },
    "22": {
        "title": "Кунг-фу Панда",
        "rating": 7.8,
        "poster": "assets/images/Кунг-фу Панда (2008).jpg",
        "age": "6+",
        "description": "Спасение Долины Мира и всех ее обитателей от непобедимого и безжалостного мастера Тай Лунга должно лечь на плечи Воина Дракона, Избранного среди лучших из лучших, коим становится... неуклюжий, ленивый и вечно голодный панда По. Ему предстоит долгий и трудный путь к вершинам мастерства кунг-фу бок о бок с легендарными воинами: Тигрой, Обезьяной, Богомолом, Гадюкой и Журавлем.",
        "media": [
            { "type": "video", "src": "PXi3Mv6KMzY" }
        ],
        "year": "2008",
        "country": "США",
        "duration": "1 ч 31 мин",
        "director": "Марк Осборн, Джон Стивенсон",
        "mpaa": "PG"
    },
    "23": {
        "title": "Пятьдесят оттенков серого",
        "rating": 4.4,
        "poster": "assets/images/Пятьдесят оттенков серого (2015).jpg",
        "age": "18+",
        "description": "Анастейша Стил — скромная студентка, живущая вместе с близкой подругой-сокурсницей Кейт. За неделю до выпускного в университете Анастейша, по просьбе заболевшей Кейт заменить её, берёт интервью у молодого красавца-миллиардера Кристиана Грея. Интервью складывается не очень удачно, и Анастейша не думает, что они когда-либо встретятся вновь. Неожиданно Грей появляется в хозяйственном магазине, где девушка работает продавцом.",
        "media": [
            { "type": "video", "src": "6z74jI8X-tE" }
        ],
        "year": "2015",
        "country": "США",
        "duration": "2 ч",
        "director": "Сэм Тейлор-Джонсон",
        "mpaa": "R"
    },
    "24": {
        "title": "Оппенгеймер",
        "rating": 8.1,
        "poster": "assets/images/Оппенгеймер (2023).jpg",
        "age": "18+",
        "description": "История жизни американского физика-теоретика Роберта Оппенгеймера, который во время Второй мировой войны руководил Манхэттенским проектом — секретными разработками ядерного оружия.",
        "media": [
            { "type": "video", "src": "uYPbbksJxIg" }
        ],
        "year": "2023",
        "country": "США, Великобритания",
        "duration": "3 ч",
        "director": "Кристофер Нолан",
        "mpaa": "R"
    },
    "25": {
        "title": "Лунный рыцарь",
        "rating": 7.1,
        "poster": "assets/images/Лунный рыцарь (сериал 2022).jpg",
        "age": "16+",
        "description": "Бывший морпех, страдающий от диссоциативного расстройства, внезапно получает власть и силы египетского бога луны.",
        "media": [
            { "type": "video", "src": "x7Krla_UxRg" }
        ],
        "year": "2022",
        "country": "США",
        "duration": "45 мин",
        "director": "Мохамед Диаб, Джастин Бенсон, Аарон Мурхед",
        "mpaa": "TV-14"
    },
    "26": {
        "title": "Проект «Конец света»",
        "rating": 8.4,
        "poster": "assets/images/Проект Конец света (2026).jpg",
        "age": "12+",
        "description": "Микробиолог Райленд Грейс просыпается на космическом корабле, не помня ни себя, ни свою миссию. Мужчина выясняет, что он — единственный выживший из экипажа, отправленного к звезде Тау Кита в поисках спасения от катастрофы на Земле. Чтобы найти решение, Райленду предстоит положиться на свои обширные научные знания и изобретательность, но, возможно, ему не придётся искать в одиночку.",
        "media": [
            { "type": "video", "src": "mdfq_P8oU-o" }
        ],
        "year": "2026",
        "country": "США",
        "duration": "2 ч 36 мин",
        "director": "Фил Лорд, Кристофер Миллер",
        "mpaa": "PG-13"
    },
    "27": {
        "title": "Уэнздей",
        "rating": 7.9,
        "poster": "assets/images/Уэнздей (сериал 2022).jpg",
        "age": "12+",
        "description": "Уэнздей, дочь Гомеса и Мортиши Аддамс, учится в академии Nevermore. Ей предстоит освоить экстрасенсорные способности, чтобы остановить местного серийного убийцу и раскрыть тайну родителей.",
        "media": [
            { "type": "video", "src": "Di310BC8UrU" }
        ],
        "year": "2022 – ...",
        "country": "США",
        "duration": "45 мин",
        "director": "Тим Бёртон, Джеймс Маршалл, Ганджа Монтейру",
        "mpaa": "TV-14"
    },
    "28": {
        "title": "Иллюзия обмана",
        "franchise": "now_you_see_me",
        "part": 1,
        "partName": "Иллюзия обмана (2013)",
        "rating": 7.8,
        "poster": "assets/images/Иллюзия обмана (2013).jpg",
        "age": "18+",
        "description": "Команда лучших иллюзионистов мира проворачивает дерзкие ограбления прямо во время своих шоу, играя в кошки-мышки с агентами ФБР.",
        "media": [
            { "type": "video", "src": "4OtM97V_Nfs" },
            { "type": "image", "src": "https://i.ytimg.com/vi/4OtM97V_Nfs/maxresdefault.jpg" }
        ],
        "year": "2013",
        "country": "США, Франция",
        "duration": "1 ч 55 мин",
        "director": "Луи Летерье",
        "mpaa": "PG-13"
    },
    "29": {
        "title": "Иллюзия обмана 2",
        "franchise": "now_you_see_me",
        "part": 2,
        "partName": "Иллюзия обмана 2 (2016)",
        "rating": 6.9,
        "poster": "assets/images/Иллюзия обмана 2 (2016).jpg",
        "age": "12+",
        "description": "«Четыре всадника», команда лучших иллюзионистов мира, возвращается в дело спустя год после побега от ФБР. Им предстоит спасти свою репутацию и вывести на чистую воду жестокого руководителя технологической корпорации.",
        "media": [
            { "type": "video", "src": "InqU8CLwb4Y" },
            { "type": "image", "src": "https://i.ytimg.com/vi/InqU8CLwb4Y/maxresdefault.jpg" }
        ],
        "year": "2016",
        "country": "США, Франция",
        "duration": "2 ч 9 мин",
        "director": "Джон М. Чу",
        "mpaa": "PG-13"
    },
    "30": {
        "title": "Гарри Поттер и философский камень",
        "franchise": "harry_potter",
        "part": 1,
        "partName": "Философский камень (2001)",
        "rating": 8.3,
        "poster": "assets/images/Гарри Поттер и философский камень (2001).jpg",
        "age": "12+",
        "description": "Сирота Гарри Поттер в свой одиннадцатый день рождения узнает, что он потомственный волшебник. Мальчика приглашают на учебу в школу магии Хогвартс, где его ждут верные друзья, первые уроки заклинаний и тайна загадочного философского камня.",
        "media": [
            { "type": "video", "src": "VyHV0BRZxoQ" }
        ],
        "year": "2001",
        "country": "Великобритания, США",
        "duration": "2 ч 32 мин",
        "director": "Крис Коламбус",
        "mpaa": "PG"
    },
    "31": {
        "title": "Гарри Поттер и Тайная комната",
        "franchise": "harry_potter",
        "part": 2,
        "partName": "Тайная комната (2002)",
        "rating": 8.2,
        "poster": "assets/images/Гарри Поттер и Тайная комната (2002).jpg",
        "age": "12+",
        "description": "На втором курсе Хогвартса происходят пугающие нападения: неизвестный монстр обращает учеников в камень. Гарри слышит странные голоса в стенах замка и пытается выяснить, кто открыл древнюю Тайную комнату Салазара Слизерина.",
        "media": [
            { "type": "video", "src": "1bq0qFFqqCA" }
        ],
        "year": "2002",
        "country": "Великобритания, США",
        "duration": "2 ч 41 мин",
        "director": "Крис Коламбус",
        "mpaa": "PG"
    },
    "32": {
        "title": "Гарри Поттер и узник Азкабана",
        "franchise": "harry_potter",
        "part": 3,
        "partName": "Узник Азкабана (2004)",
        "rating": 8.3,
        "poster": "assets/images/Гарри Поттер и узник Азкабана (2004).jpg",
        "age": "12+",
        "description": "Из охраняемой магической тюрьмы Азкабан сбегает Сириус Блэк — опасный волшебник, считающийся приспешником Темного Лорда. В школу для защиты прибывают жуткие дементоры, а Гарри открывает тайны прошлого своих родителей.",
        "media": [
            { "type": "video", "src": "lAxgztbYDbs" }
        ],
        "year": "2004",
        "country": "Великобритания, США",
        "duration": "2 ч 22 мин",
        "director": "Альфонсо Куарон",
        "mpaa": "PG"
    },
    "33": {
        "title": "Гарри Поттер и Кубок огня",
        "franchise": "harry_potter",
        "part": 4,
        "partName": "Кубок огня (2005)",
        "rating": 8.0,
        "poster": "assets/images/Гарри Поттер и Кубок огня (2005).jpg",
        "age": "16+",
        "description": "Хогвартс принимает Турнир Трех Волшебников — опаснейшее состязание магических школ. Вопреки правилам, Кубок огня выбирает Гарри четвертым участником. Теперь ему предстоит пройти смертельные испытания и встретиться лицом к лицу с вернувшимся злом.",
        "media": [
            { "type": "video", "src": "3EGojp4Hh6I" }
        ],
        "year": "2005",
        "country": "Великобритания, США",
        "duration": "2 ч 37 мин",
        "director": "Майк Ньюэлл",
        "mpaa": "PG-13"
    },
    "34": {
        "title": "Гарри Поттер и Орден Феникса",
        "franchise": "harry_potter",
        "part": 5,
        "partName": "Орден Феникса (2007)",
        "rating": 7.9,
        "poster": "assets/images/Гарри Поттер и Орден Феникса (2007).jpg",
        "age": "16+",
        "description": "Министерство магии отказывается верить в возвращение Волан-де-Морта и назначает в Хогвартс строгого инспектора Долорес Амбридж. Не имея возможности изучать защитную магию на уроках, Гарри тайно собирает Отряд Дамблдора.",
        "media": [
            { "type": "video", "src": "y6ZW7gVpmsI" }
        ],
        "year": "2007",
        "country": "Великобритания, США",
        "duration": "2 ч 18 мин",
        "director": "Дэвид Йейтс",
        "mpaa": "PG-13"
    },
    "35": {
        "title": "Гарри Поттер и Принц-полукровка",
        "franchise": "harry_potter",
        "part": 6,
        "partName": "Принц-полукровка (2009)",
        "rating": 7.9,
        "poster": "assets/images/Гарри Поттер и Принц-полукровка (2009).jpg",
        "age": "12+",
        "description": "Темные силы начинают открытое наступление. Вместе с профессором Дамблдором Гарри погружается в воспоминания прошлого, чтобы найти ключ к бессмертию Волан-де-Морта — крестражи, попутно изучая старый учебник загадочного Принца-полукровки.",
        "media": [
            { "type": "video", "src": "sg81Lts5kYI" }
        ],
        "year": "2009",
        "country": "Великобритания, США",
        "duration": "2 ч 33 мин",
        "director": "Дэвид Йейтс",
        "mpaa": "PG"
    },
    "36": {
        "title": "Гарри Поттер и Дары Смерти: Часть I",
        "franchise": "harry_potter",
        "part": 7,
        "partName": "Дары Смерти: Часть I (2010)",
        "rating": 7.9,
        "poster": "assets/images/Гарри Поттер и Дары Смерти Часть I (2010).jpg",
        "age": "16+",
        "description": "Гарри, Рон и Гермиона пускаются в бега и начинают опасную охоту за крестражами без помощи наставников. Им предстоит полагаться только друг на друга, скрываясь от Пожирателей смерти и раскрывая легенду о могущественных Дарах Смерти.",
        "media": [
            { "type": "video", "src": "MxqsmsA8y5k" }
        ],
        "year": "2010",
        "country": "Великобритания, США",
        "duration": "2 ч 26 мин",
        "director": "Дэвид Йейтс",
        "mpaa": "PG-13"
    },
    "37": {
        "title": "Гарри Поттер и Дары Смерти: Часть II",
        "franchise": "harry_potter",
        "part": 8,
        "partName": "Дары Смерти: Часть II (2011)",
        "rating": 8.2,
        "poster": "assets/images/Гарри Поттер и Дары Смерти Часть II (2011).jpg",
        "age": "16+",
        "description": "Финал многолетнего противостояния. Поиски оставшихся крестражей приводят героев обратно в Хогвартс, стены которого становятся полем грандиозной битвы добра и зла, где решится судьба всего волшебного мира.",
        "media": [
            { "type": "video", "src": "mObK5XD8udk" }
        ],
        "year": "2011",
        "country": "Великобритания, США",
        "duration": "2 ч 10 мин",
        "director": "Дэвид Йейтс",
        "mpaa": "PG-13"
    },
    "38": {
        "title": "Гарри Поттер 20 лет спустя: Возвращение в Хогвартс",
        "franchise": "harry_potter",
        "part": 9,
        "partName": "Возвращение в Хогвартс (2022)",
        "rating": 8.0,
        "poster": "assets/images/Гарри Поттер 20 лет спустя Возвращение в Хогвартс (2022).jpg",
        "age": "18+",
        "description": "Дэниэл Рэдклифф, Руперт Гринт, Эмма Уотсон и создатели легендарной киносаги встречаются в декорациях Хогвартса спустя 20 лет после выхода первого фильма, чтобы поделиться теплыми воспоминаниями и закулисными историями.",
        "media": [
            { "type": "video", "src": "fFGS4zZWGoA" }
        ],
        "year": "2022",
        "country": "Великобритания, США",
        "duration": "1 ч 39 мин",
        "director": "Кэйси Паттерсон, Джо Перлман, Эрен Криви",
        "mpaa": "PG"
    },
    "39": {
        "title": "365 дней",
        "rating": 5.1,
        "poster": "assets/images/365 дней (2020).jpg",
        "age": "18+",
        "description": "Глава влиятельного сицилийского клана Массимо похищает молодую карьеристку Лауру, чья личная жизнь зашла в тупик. Он отводит девушке ровно один год в роскошном особняке, чтобы за этот срок она смогла искренне его полюбить.",
        "media": [
            { "type": "video", "src": "pyM3z73oMAk" }
        ],
        "year": "2020",
        "country": "Польша",
        "duration": "1 ч 54 мин",
        "director": "Барбара Бяловас, Томаш Мандес",
        "mpaa": "18+"
    },
    "40": {
        "title": "Ангел",
        "rating": 6.6,
        "poster": "assets/images/Ангел (2007).jpg",
        "age": "18+",
        "description": "Англия, начало двадцатого столетия. Бедная мечтательница Анжела грезит о всемирной литературной славе. Публикация первого любовного романа мгновенно открывает ей двери в высший свет, но путь на вершину омрачен иллюзиями и разочарованиями.",
        "media": [
            { "type": "video", "src": "yW4Y-R14s7E" }
        ],
        "year": "2007",
        "country": "Франция, Бельгия, Великобритания",
        "duration": "2 ч 8 мин",
        "director": "Франсуа Озон",
        "mpaa": "18+"
    },
    "41": {
        "title": "Хранитель Луны",
        "rating": 7.4,
        "poster": "assets/images/Хранитель Луны (2014).jpg",
        "age": "0+",
        "description": "В сказочном мире, где Солнце и Луну перемещают вручную, юный лесной фавн Мьюн случайно теряет доверенное ему ночное светило. Воспользовавшись хаосом, подземный владыка крадет Солнце, и Мьюну приходится отправиться в опасный поход за спасением равновесия.",
        "media": [
            { "type": "video", "src": "7s0_n5K23x0" }
        ],
        "year": "2014",
        "country": "Франция, Канада",
        "duration": "1 ч 25 мин",
        "director": "Александр Эбоян, Бенуа Филиппон",
        "mpaa": "PG"
    },
    "42": {
        "title": "Грань будущего",
        "rating": 7.9,
        "poster": "assets/images/Грань будущего (2014).jpg",
        "age": "18+",
        "description": "Земля подверглась разрушительному нападению неуязвимой расы мимиков. Майор Уильям Кейдж погибает в первые минуты высадки на пляж, но вступает в контакт с пришельцем и застревает во временной петле. С каждым новым циклом и новой смертью его боевые навыки совершенствуются.",
        "media": [
            { "type": "video", "src": "vw61gCe2oqI" }
        ],
        "year": "2014",
        "country": "США, Канада",
        "duration": "1 ч 53 мин",
        "director": "Даг Лайман",
        "mpaa": "PG-13"
    },
    "43": {
        "title": "Тихоокеанский рубеж",
        "franchise": "pacific_rim",
        "part": 1,
        "partName": "Тихоокеанский рубеж (2013)",
        "rating": 7.0,
        "poster": "assets/images/Тихоокеанский рубеж (2013).jpg",
        "age": "18+",
        "description": "Из разлома на дне океана появляются колоссальные монстры — кайдзю. Чтобы противостоять им, человечество проектирует гигантских роботов «Егерей», управляемых двумя пилотами в режиме нейронного моста. Последней надеждой обороны становится списанный робот ветеран.",
        "media": [
            { "type": "video", "src": "5guqBebVl10" }
        ],
        "year": "2013",
        "country": "США, Мексика",
        "duration": "2 ч 11 мин",
        "director": "Гильермо дель Торо",
        "mpaa": "PG-13"
    },
    "44": {
        "title": "Тихоокеанский рубеж 2",
        "franchise": "pacific_rim",
        "part": 2,
        "partName": "Тихоокеанский рубеж 2 (2018)",
        "rating": 5.7,
        "poster": "assets/images/Тихоокеанский рубеж 2 (2018).jpg",
        "age": "16+",
        "description": "Спустя годы после закрытия тихоокеанского портала монстры находят новый изощренный способ проникнуть в наш мир. Сын легендарного маршала Пентекоста возглавляет новое поколение молодых кадетов и пилотов модернизированных роботов.",
        "media": [
            { "type": "video", "src": "_EhiFET4wgg" }
        ],
        "year": "2018",
        "country": "Великобритания, Китай, Япония, США, Мексика",
        "duration": "1 ч 50 мин",
        "director": "Стивен С. ДеНайт",
        "mpaa": "PG-13"
    },
    "45": {
        "title": "Тихоокеанский рубеж: Тёмная зона",
        "franchise": "pacific_rim",
        "part": 3,
        "partName": "Тёмная зона (сериал)",
        "rating": 6.5,
        "poster": "assets/images/Тихоокеанский рубеж Тёмная зона (сериал 2021 – 2022).jpg",
        "age": "16+",
        "description": "Австралийский континент полностью захвачен полчищами кайдзю. Брат и сестра Тейлор и Хейли находят брошенного тренировочного Егеря «Атлас Разрушитель» и отправляются через выжженные пустоши на поиски своих пропавших родителей.",
        "media": [
            { "type": "video", "src": "2Qk8IdUB-cE" }
        ],
        "year": "2021 – 2022",
        "country": "США, Австралия",
        "duration": "25 мин",
        "director": "Хироюки Хаяси, Джэ Х. Ким",
        "mpaa": "TV-14"
    },
    "46": {
        "title": "Паук-Нуар",
        "rating": 7.4,
        "poster": "assets/images/Паук-Нуар (мини–сериал 2026).jpg",
        "age": "16+",
        "description": "Нью-Йорк времен Великой депрессии 1930-х годов. Пожилой и уставший от жизни частный сыщик Бен Райлли пытается свести концы с концами. Когда криминальный мир мегаполиса выходит из-под контроля, герою приходится вспомнить свое супергеройское прошлое и вновь надеть маску Человека-паука.",
        "media": [
            { "type": "video", "src": "O6qPW_w0g_g" }
        ],
        "year": "2026",
        "country": "США",
        "duration": "45 мин",
        "director": "Гарри Брэдбир, Алетеа Джонс",
        "mpaa": "TV-MA"
    },
    "47": {
        "title": "Элементарно",
        "rating": 7.7,
        "poster": "assets/images/Элементарно (2023).jpg",
        "age": "6+",
        "description": "В фантастическом мегаполисе Элемент-Сити бок о бок обитают представители четырех стихий: огня, воды, земли и воздуха. Вспыльчивая и преданная семейному делу девушка Эмбер случайно знакомится с жизнерадостным водяным парнем Уэйдом. Их зарождающиеся чувства ставят под сомнение главное правило города: стихии не смешиваются.",
        "media": [
            { "type": "video", "src": "hXzcyx9V0xw" }
        ],
        "year": "2023",
        "country": "США",
        "duration": "1 ч 41 мин",
        "director": "Питер Сон",
        "mpaa": "PG"
    },
    "48": {
        "title": "Алита: Боевой ангел",
        "rating": 7.2,
        "poster": "assets/images/Алита Боевой ангел (2019).jpg",
        "age": "18+",
        "description": "XXVI век, постапокалиптический Железный город. Доктор Идо находит на гигантской свалке останки девушки-киборга и восстанавливает ее тело. Придя в сознание, Алита ничего не помнит о своем прошлом, но вскоре обнаруживает в себе уникальные боевые рефлексы легендарных марсианских воинов.",
        "media": [
            { "type": "video", "src": "csl8q2pMwbM" }
        ],
        "year": "2019",
        "country": "США, Япония",
        "duration": "2 ч 1 мин",
        "director": "Роберт Родригес",
        "mpaa": "PG-13"
    },
    "49": {
        "title": "Поток",
        "rating": 8.1,
        "poster": "assets/images/Поток (2024).jpg",
        "age": "6+",
        "description": "Мир погружается в пучину колоссального наводнения, уничтожающего привычную среду обитания. Одинокий черный кот находит спасение в дрейфующей лодке, где ему приходится делить крошечное убежище с капибарой, лемуром, собакой и птицей-секретарем, преодолевая природный страх воды и учась взаимовыручке.",
        "media": [
            { "type": "video", "src": "k9_m80h5UjA" }
        ],
        "year": "2024",
        "country": "Латвия, Бельгия, Франция",
        "duration": "1 ч 25 мин",
        "director": "Гинтс Зильбалодис",
        "mpaa": "PG"
    }
};